---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
CompoundStructure..::..GetWidth Method
CompoundStructure Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetWidth()()()() | The width implied by this compound structure. |
|  | GetWidth(Int32) | Computes the width of the envelope (2d bounding box) of the specified region. |

# See Also

CompoundStructure Class

CompoundStructure Members

Autodesk.Revit.DB Namespace